tags/2.0.9/docs/internal/testmessages/RegisterTrigger.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP:Body>
        <RegisterTrigger xmlns="http://emailioconnector.coe.cordys.com/2.0/inbound/dynamic">
            <emailbox>imap's mailbox</emailbox>
            <trigger>
                <name>10010</name>
                <description>For SO 1004</description>
                <combineemails>false</combineemails>
                <rules>
                    <rule section="subject">
                        <pattern type="regex">
                            <value>.+(10010) from customer (\d+)</value>
                            <store>
                                <token>
                                    <name>OrderID</name>
                                    <value>1</value>
                                </token>
                                <token>
                                    <name>CustomerID</name>
                                    <value>2</value>
                                </token>
                            </store>
                        </pattern>
                    </rule>
                </rules>
                <message>
                    <user>cn=pgussow,cn=organizational users,o=MRO,cn=cordys,o=vanenburg.com</user>
                    <method>HandleSalesOrder</method>
                    <namespace>http://coe.schemas.cordys.com/SO</namespace>
                    <sync>true</sync>
                    <repeatingxpath>./SalesOrder</repeatingxpath>
                    <input>
                        <SalesOrder>
                            <SalesOrderID/>
                            <SalesOrderDate/>
                            <SalesOrderCustomerID/>
                            <SalesOrderLines/>
                            <FileName/>
                            <EmailContent/>
                        </SalesOrder>
                    </input>
                    <mappings>
                        <mapping>
                            <source>./SalesOrderID</source>
                            <value src="OrderID"/>
                        </mapping>
                        <mapping>
                            <source>./SalesOrderCustomerID</source>
                            <value src="CustomerID"/>
                        </mapping>
                        <mapping>
                            <source>./EmailContent</source>
                            <value src="sysXMLEmail"/>
                        </mapping>
                    </mappings>
                </message>
            </trigger>
        </RegisterTrigger>
    </SOAP:Body>
</SOAP:Envelope>
